/*
Напишите функцию `includesElement`, которая принимает массив и элемент, а затем возвращает булево значение, указывающее, содержится ли данный элемент в массиве. Для перебора элементов используйте цикл `for`.

Входные данные:
- `array`: Массив, в котором нужно проверить наличие элемента. Массив может содержать любые типы данных.
- `element`: Элемент, наличие которого нужно проверить в массиве.

Выходные данные:
- `true`: Если элемент найден в массиве.
- `false`: Если элемент отсутствует в массиве.

Пример использования:
includesElement([1, 2, 3], 2)  // должен вернуть `true`.
*/

let array = [1, 3, 2, 6, 5, 4];
let element = 2;

function includesElement(arr,el) {

     for ( let i = 0; i < arr.length; i++ ){
        if( arr[i] === el){
          return true;
        } 
     } 
     return false;
}

includesElement(array, element);

console.log(includesElement(array, element));
